package ru.gloomy.geoquiz.Lecture;


public class Lecture {

    private String title;
    private String lecture;
    public static final Lecture[] lectures = {
            new Lecture("1. Горы и Возвышенности",
                    "Горы — сильно расчленённые части суши, значительно, на 500 метров и более, приподнятые над прилегающими равнинами. " +
                            "От равнин горы отделены либо напрямую подножием склона, либо предгорьями." +
                            "Горы могут быть линейно вытянутыми или дугообразными с параллельным, решётчатым, " +
                            "радиальным, перистым, кулисным или ветвистым рисунком расчленения. " +
                            "Различают высокогорья, среднегорья и низкогорья."+"\n"+"\n"+
                            "\b№1. Джомолунгма\b(Гималаи) - 8848 метров." +"\n"+
                            "Джомолунгма (Эверест) - высочайшая вершина Земли." +
                            "В переводе с тибетского «Джомолунгма» - «Божественная (jomo) Мать (ma) жизненной энергии (lung)». " +
                            "Гора названа так в честь бонской богини Шераб Чжаммы."+"\n"+
                    "\n"+
                            "№2. Чогори (Каракорум) - 8614 метров." +
                            "Чогори - вторая из самых высоких вершин в мире. Чогори впервые была обнаружена европейской экспедицией " +
                            "в 1856 году и была обозначена как гора К2, то есть вторая вершина Каракорума." +
                            "Первая попытка восхождения была совершена в 1902 году Оскаром Эккенштейном и Алистером Кроули, однако закончилась неудачей."+"\n"+
                    "\n"+
                            "№3. Канченджанга (Гималаи) - 8586 метров." +"\n"+
                            "Канченджанга занимает третью строчку в рейтинге самых высоких вершин мира. Высота вершины - 8586 метров." +"\n"+
                            "До 1852 года Канченджанга считалась самой высокой вершиной мира, но после расчетов, выполненных "+
                            "на основе данных экспедиции 1849 года, было доказано, что самая высокая гора - Эверест."+"\n"+
                    "\n"+
                            "№4. Лхоцзе (Гималаи) - 8516 метров." +"\n"+
                            "Лхоцзе - четвертая по высоте вершина в мире, высотой 8516 метров. Находитсяна территории Тибетского автономного округа." +"\n"+
                            "Первое успешное восхождение было совершено 18 мая 1956 года " +
                            "швейцарской экспедицией в составе которой были: Эрнст Райсс и Фриц Лухсингер." +
                            "Из всех попыток восхождения на Лхоцзе успехом увенчались лишь 25%."+"\n"+
                    "\n"+
                            "№5. Макалу (Гималаи) - 8485 метров." +
                            "Макалу - пятая по высоте вершина в мире. Расположена в центральных Гималаях, " +
                            "на границе Непала с Китаем (Тибетский автономный район).\n" +
                            "Первые попытки восхождения начались в середине 50-ых годов 20 века. Это можно объяснить тем, " +
                            "что большинство экспедиций хотело покорить Джомолунгму и Лхоцзе, " +
                            "а Макалу и другие менее известные соседние вершины оставалась в тени"),

            new Lecture("2. Города",
                    "Го́род — крупный населённый пункт, жители которого заняты, как правило, не сельским хозяйством. " +
                            "Имеет развитый комплекс хозяйства и экономики. Является скоплением архитектурных и инженерных сооружений, " +
                            "обеспечивающих жизнедеятельность постоянного и временного населения города.\n" +
                            "Исторически термин происходит от наличия вокруг поселения оборонительной ограды — вала или стены. " +
                            "В Древней Руси городом называлось всякое крупное жилое место, окружённое такой оградой. " +
                            "Города служили центром развития искусства и ремёсел, технических достижений."+"\n"+
            "\n"+"1. \tг. Москва\t12 615 882" + "\n"
            +"2. \tг. Санкт-Петербург\t5 383 890"+ "\n"
            +"3. \tг. Новосибирск\t1 618 039\t"+ "\n"
            +"4. \tг. Екатеринбург\t1 483 119\t"+ "\n"
            +"5. \tг. Нижний Новгород\t1 253 511"),
            new Lecture("3. Реки.",
                    "Река́ — природный водный поток (водоток[1]) значительных размеров с естественным течением по руслу (выработанному им естественному углублению) " +
                            "от истока вниз до устья[2] и питающийся за счёт поверхностного и подземного стока с его бассейна."
                             + "\n"+"1.tАмазо́нка (исп. и порт. Amazonas) — самая полноводная река в мире, расположенная в Южной Америке. " +
                            "Образуется слиянием рек Мараньон и Укаяли. Длина Амазонки является в научном сообществе дискуссионным вопросом и по различным измерениям составляет: " +
                            "от истока реки Мараньон — около 6400 км[1], от истока реки Апачет — 6992 км[2], от истока Укаяли — около 7100 км[1]. " +
                            "Амазонка со своим длиннейшим истоком претендует, " +
                            "вместе с Нилом, на статус самого длинного водотока в мире, а также является крупнейшей в мире рекой по площади бассейна и полноводности. " +
                            "Годовой сток реки составляет 6937,92 км³, " +
                            "то есть в сутки она выносит примерно 19 км³ воды.\n" +
                                      "\n" +
                                      "Площадь бассейна с учётом притока Токантинс — 7180 тыс. км²[1]. Это заметно превышает бассейн рек Уругвай и " +
                            "Парана вместе (4140 тыс. км²) и Конго (около 3700 тыс. км²)." + "\n"
                            +"2. \t Нил\t. Слово «Нил» происходит от греческого названия реки «Нейлос» (Νεῖλος).\n" +
                                      "\n" +
                                      "Река берёт начало на Восточно-Африканском плоскогорье и впадает в Средиземное море, образуя дельту площадью 24 тыс. км²[2]. " +
                            "Среднегодовой расход воды в устье Нила 2900 м³/сек[3]. В верхнем течении принимает крупные притоки — " +
                            "Эль-Газаль (левый) и Асуа, Собат, Голубой Нил и Атбара (правые). " +
                            "Ниже устья правого притока Атбары Нил течёт по полупустыне, не имея притоков на протяжении последних 3000 км[4]."+ "\n"
                                      +"3. \tЯнцзы́\t  «Длинная река»; в нижнем течении исторически также кит. трад. 揚子江, упр. 扬子江, пиньинь Yángzǐ Jiāng, палл. " +
                            "Янцзыцзян Listen (инф.); устар. передача Ян-цзы-цзян[2]) — самая длинная и многоводная река Евразии, третья в мире по полноводности и четвёртая в мире по длине. " +
                            "Протекает по территории Китая, имеет длину около 6300 км (также это самая длинная в мире река, протекающая по территории " +
                            "одного государства), площадь бассейна — 1 808 500 км²[3][4]. Впадает в Восточно-Китайское море[4][5]."
                            +"4. \t Миссу́ри\t река в США, крупнейший по протяжённости и второй по полноводности приток Миссисипи[1].\n" +
                                      "\n" +
                                      "Длина реки составляет 3767 км[2] (Миссури лишь на 3 км уступает по длине Миссисипи и является вторым по длине рекой-притоком в мире после Иртыша в России). " +
                            "Берёт начало в Скалистых горах, течёт главным образом в восточном и юго-восточном направлениях. " +
                            "Впадает в Миссисипи вблизи города Сент-Луис. Площадь бассейна составляет более 1 300 000 км² и включает часть территории десяти штатов США и двух провинций Канады.\t"+ "\n"
                            +"5. \tХуанхэ́\t река в Китае, одна из крупнейших рек Азии[2]. В переводе с китайского языка её название — " +
                            "«Жёлтая река», что связано с обилием наносов, придающих желтоватый оттенок её водам[3]. Именно благодаря им море, в которое впадает река, " +
                            "называется Жёлтым. Бассейн Хуанхэ считается местом формирования и становления китайского этноса.\n" +
                                      "\n" +
                                      "Хуанхэ берёт начало в восточной части Тибетского нагорья на высоте свыше 4500 м, протекает через озёра Орин-Нур и Джарин-Нур, " +
                            "отроги горных массивов Куньлунь и Наньшань. При пересечении Ордоса и Лёссового плато в своём среднем течении образует большую излучину, " +
                            "далее через ущелья Шаньсийских гор выходит на Великую Китайскую равнину, по которой течёт около 700 км до впадения в залив Бохайвань Жёлтого моря, " +
                            "формируя в районе впадения дельту. По разным данным длина реки от 4670 км до 5464 км, а площадь её бассейна от 745 тыс. км² до 771 тыс. км²" +
                            ". Средний расход воды — 2571 м³/с.\t"+ "\n"
                           ),
            new Lecture("4. Моря и Океаны",
                    "Океа́н (др.-греч. Ὠκεανός, от имени древнегреческого божества Океана) — крупнейший водный объект, составляющий часть Мирового океана, расположенный " +
                            "среди материков, обладающий системой циркуляции вод и другими специфическими особенностями. " +
                            "Океан находится в непрерывном взаимодействии с атмосферой и земной корой.\nКраткая характеристика океанов\n" +
                            "Тихий океан\n"+
                            "Самый большой по площади и глубине океан на Земле. Расположен между материками Евразией и Австралией на западе, " +
                            "Северной и Южной Америкой на востоке, Антарктидой на юге. На севере через Берингов пролив сообщается с водами Северного Ледовитого, а на юге — Атлантического и " +
                            "Индийского океанов. Занимающий 49,5 % поверхности Мирового океана и вмещающий 53 % объёма воды Мирового океана, Тихий океан простирается приблизительно на 15,8 " +
                            "тысячи км с севера на юг и на 19,5 тысяч км с востока на запад. Через Тихий океан примерно по 180-му меридиану проходит линия перемены даты. Изучение и освоение " +
                            "Тихого океана начались задолго до появления письменной истории человечества. Для плавания по океану использовались джонки, катамараны и простые плоты. Экспедиция 1947 " +
                            "года на плоту из бальсовых брёвен «Кон-Тики» под руководством норвежца Тура Хейердала доказала возможность пересечения Тихого океана в западном направлении из" +
                            " центральной части Южной Америки к островам Полинезии. Китайские джонки совершали походы вдоль берегов океана в Индийский океан (например, семь путешествий " +
                            "Чжэн Хэ в 1405—1433 годах)[5]. В настоящее время побережье и острова Тихого океана освоены и заселены крайне неравномерно. Наиболее крупными центрами промышленного" +
                            " освоения являются побережье США (от района Лос-Анджелеса до района Сан-Франциско), побережье Японии и Южной Кореи. Значительна роль океана в экономической " +
                            "жизни Австралии и Новой Зеландии[6].\n" +
                            "\n" +
                            "Атлантический океан\n" +
                            "Второй по величине океан Земли после Тихого океана, название произошло от имени титана Атласа (Атланта) в греческой " +
                            "мифологии или от легендарного острова Атлантида. Он простирается от субарктических широт до самой Антарктиды[7]. Граница с Индийским океаном проходит по меридиану " +
                            "мыса Игольный (20° в. д. до побережья Антарктиды (Земля Королевы Мод). Границу с Тихим океаном проводят от мыса Горн по меридиану 68°04’ з. д. или по кратчайшему " +
                            "расстоянию от Южной Америки до Антарктического полуострова через пролив Дрейка, от острова Осте до мыса Штернек. Граница с Северным Ледовитым океаном проходит " +
                            "по восточному входу Гудзонова пролива, далее через Пролив Дэвиса и по побережью острова Гренландия до мыса Брустер, через Датский пролив до мыса Рейдинупюр " +
                            "на острове Исландия, по его побережью до мыса Герпир, затем к Фарерским островам, далее к Шетландским островам и по 61° северной широты до побережья Скандинавского полуострова. " +
                            "Площадь морей, заливов и проливов Атлантического океана составляет 14,69 млн км² (16 % от общей площади океана), объём 29,47 млн км³ (8,9 %). " +
                            "Площадь 91,6 млн км², из которых около четверти приходится на внутриконтинентальные моря. Площадь прибрежных морей невелика и не превышает 1 % от общей площади акватории. " +
                            "Объём вод составляет 329,7 млн км³, что равно 25 % объёма Мирового океана. Средняя глубина — 3736 м, наибольшая — 8742 м (жёлоб Пуэрто-Рико). " +
                            "Среднегодовая солёность вод океана составляет около 35 ‰. Атлантический океан имеет сильно изрезанную береговую" +
                            " линию с выраженным членением на региональные акватории: моря и заливы.\n" +
                            "\n" +
                            "Индийский океан\n" +
                            "Третий по размеру океан Земли, покрывающий около 20 % её водной поверхности. Индийский океан главным образом расположен к" +
                            " югу от тропика Рака между Евразией на севере, Африкой на западе, Австралией на востоке и Антарктидой на юге[7]. Его площадь составляет 76,17 " +
                            "млн км², объём — 282,65 млн км³. На севере омывает Азию, на западе — Аравийский полуостров и Африку, на востоке — Индокитай, Зондские острова и Австралию; " +
                            "на юге граничит с Южным океаном. Граница с Атлантическим океаном проходит по 20° меридиану восточной долготы; с Тихим — по 147° меридиану восточной долготы. " +
                            "Самая северная точка Индийского океана находится примерно на 30° северной широты в Персидском заливе. Ширина Индийского океана составляет" +
                            " приблизительно 10 000 км между южными точками Австралии и Африки.\n" +
                            "\n" +
                            "\n" +
                            "Южный океан\n" +
                            "Северный Ледовитый океан (англ. Arctic Ocean, дат. Ishavet, норв. и нюнорск Nordishavet) — наименьший по площади океан Земли, расположен между " +
                            "Евразией и Северной Америкой. Площадь 14,75 млн км², то есть чуть больше 4 % от всей площади Мирового океана, объём воды 18,07 млн км³. " +
                            "Северный Ледовитый океан самый мелководный из всех океанов, его средняя глубина составляет 1225 м (наибольшая глубина 5527 м в Гренландском море)[10].\n" +
                            "\n" +
                            "Южный Океан (англ. Southern Ocean) — самый южный океан Земли. Окружает Антарктиду, площадь 20,327 млн км², средняя глубина 3270 м, " +
                            "объём воды 72,37 млн км³. Наибольшая глубина в Южно-Сандвичевом жёлобе — 8264 м. Южный океан омывает на севере Индийским океаном, " +
                            "юго-восточные Тихим океаном, на северо-западе Атлантическим океаном. Самый холодный океан, средняя температура равна −12 °С.")};

    private Lecture(String title, String lecture) {
        this.title = title;
        this.lecture = lecture;
    }

    public String getLecture() {
        return lecture;
    }

    public String getTitle() {
        return title;
    }

    public String toString() {
        return this.title;
    }

}
